app/controllers/agenda_docs_controller.rb

SELECT * FROM `agenda_docs` WHERE (`agenda_docs`.`id` = 1)
---
  def show
    @agenda_doc = AgendaDoc.find(params[:id])

SELECT * FROM `agenda_docs` WHERE (`agenda_docs`.`id` = 1)
---
  def edit
    @agenda_doc = AgendaDoc.find(params[:id])

INSERT INTO `agenda_docs` (`updated_at`, `title`, `date`, `content`, `who`, `created_at`) VALUES('2009-03-07 16:28:02', 'test agenda', '2009-03-07 16:27:00', 'hello world', 'markwell, fuller, watson', '2009-03-07 16:28:02')
---
  def create
    @agenda_doc = AgendaDoc.new(params[:agenda_doc])

    respond_to do |format|
      if @agenda_doc.save